with tab7:
            st.subheader('Info')
            st.write("""
            ## Application Info
           Upload data:

Οι χρήστες μπορούν να ανεβάσουν το σύνολο δεδομένων τους σε μορφή CSV ή Excel μέσω της πλευρικής γραμμής.
Η εφαρμογή διαβάζει το αρχείο και εμφανίζει τα δεδομένα σε μορφή πίνακα.
Εμφανίζονται βασικά στατιστικά και το σχήμα των δεδομένων για να παρέχουν μια επισκόπηση του συνόλου δεδομένων.
Καρτέλες και Χαρακτηριστικά:
Scatter Plot:

Οι χρήστες μπορούν να επιλέξουν δύο χαρακτηριστικά από το σύνολο δεδομένων για να δημιουργήσουν ένα διάγραμμα διασποράς.
Το διάγραμμα διασποράς βοηθά στην οπτικοποίηση της σχέσης μεταξύ των επιλεγμένων χαρακτηριστικών.
                     
2D Visualization:

Οι χρήστες μπορούν να επιλέξουν μεταξύ PCA (κύρια συνιστώσα ανάλυσης) και t-SNE (κατανεμημένη ενσωμάτωση γειτονικής σχέση) για μείωση διαστάσεων.
Η μειωμένη 2D αναπαράσταση των δεδομένων απεικονίζεται για να βοηθήσει στην κατανόηση της κατανομής των δεδομένων.
                     
EDA:

Εμφανίζει την κατανομή της στήλης ετικετών.
Παρέχει ένα διάγραμμα ζευγών για την οπτικοποίηση σχέσεων μεταξύ διαφορετικών χαρακτηριστικών.
Δείχνει έναν θερμικό χάρτη συσχετίσεων για να εντοπίσει συσχετίσεις μεταξύ χαρακτηριστικών.
                     
Classification:

Οι χρήστες μπορούν να εφαρμόσουν τους ταξινομητές K-Nearest Neighbors (KNN) και Decision Tree στα δεδομένα.
Η εφαρμογή χωρίζει τα δεδομένα σε σύνολα εκπαίδευσης και δοκιμών.
Εμφανίζονται η ακρίβεια, ο πίνακας σύγχυσης και η αναφορά ταξινόμησης και για τους δύο ταξινομητές.
                     
Clustering:

Οι χρήστες μπορούν να εφαρμόσουν τους αλγόριθμους ομαδοποίησης K-Means και Gaussian Mixture Model (GMM).
Ο αριθμός των ομάδων μπορεί να προσαρμοστεί χρησιμοποιώντας ρυθμιστικά.
Εμφανίζονται οι βαθμολογίες και για τις δύο μεθόδους ομαδοποίησης για την αξιολόγηση της απόδοσης της.
                     
Results and Comperison:
                     
Περίληψη των αποτελεσμάτων των αλγορίθμων ταξινόμησης και ομαδοποίησης.
Σύγκριση της απόδοσης των αλγορίθμων βάσει ακρίβειας.
                     
Μέλη Ομάδας και Τasks:
Νεοκλής Χαριζάι (inf2021245)
Upload Data - Table Specification - 2D Visualization Tab - Machine Learning
Γιώργος Τσανικίδης (inf2021232) 
Docker File - Info Tab - Κύκλος Ζωής Έκδοσης Λογισμικού
Γιώργος Χρυσοβαλάντης κοτρίδης (inf2021101)         
Comparison and Results(Machine Learning) - LaTeX

[Όλα τα μέλη της ομάδας ασχολήθηκαν με όλα τα task της εργασίας. Απλά ο κάθενας εξειδικεύτηκε στα παραπάνω]
                                          
""")
